apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_sio.h
/****************************************************************************
 * arch/arm/src/rp2040/hardware/rp2040_sio.h
 *
 * Generated from rp2040.svd originally provided by
 *   Raspberry Pi (Trading) Ltd.
 *
 * Copyright 2020 (c) 2020 Raspberry Pi (Trading) Ltd.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_SIO_H
#define __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_SIO_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/rp2040_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define RP2040_SIO_CPUID_OFFSET               0x000000  /* Processor core identifier Value is 0 when read from processor core 0, and 1 when read from processor core 1. */
#define RP2040_SIO_GPIO_IN_OFFSET             0x000004  /* Input value for GPIO pins */
#define RP2040_SIO_GPIO_HI_IN_OFFSET          0x000008  /* Input value for QSPI pins */
#define RP2040_SIO_GPIO_OUT_OFFSET            0x000010  /* GPIO output value */
#define RP2040_SIO_GPIO_OUT_SET_OFFSET        0x000014  /* GPIO output value set */
#define RP2040_SIO_GPIO_OUT_CLR_OFFSET        0x000018  /* GPIO output value clear */
#define RP2040_SIO_GPIO_OUT_XOR_OFFSET        0x00001c  /* GPIO output value XOR */
#define RP2040_SIO_GPIO_OE_OFFSET             0x000020  /* GPIO output enable */
#define RP2040_SIO_GPIO_OE_SET_OFFSET         0x000024  /* GPIO output enable set */
#define RP2040_SIO_GPIO_OE_CLR_OFFSET         0x000028  /* GPIO output enable clear */
#define RP2040_SIO_GPIO_OE_XOR_OFFSET         0x00002c  /* GPIO output enable XOR */
#define RP2040_SIO_GPIO_HI_OUT_OFFSET         0x000030  /* QSPI output value */
#define RP2040_SIO_GPIO_HI_OUT_SET_OFFSET     0x000034  /* QSPI output value set */
#define RP2040_SIO_GPIO_HI_OUT_CLR_OFFSET     0x000038  /* QSPI output value clear */
#define RP2040_SIO_GPIO_HI_OUT_XOR_OFFSET     0x00003c  /* QSPI output value XOR */
#define RP2040_SIO_GPIO_HI_OE_OFFSET          0x000040  /* QSPI output enable */
#define RP2040_SIO_GPIO_HI_OE_SET_OFFSET      0x000044  /* QSPI output enable set */
#define RP2040_SIO_GPIO_HI_OE_CLR_OFFSET      0x000048  /* QSPI output enable clear */
#define RP2040_SIO_GPIO_HI_OE_XOR_OFFSET      0x00004c  /* QSPI output enable XOR */
#define RP2040_SIO_FIFO_ST_OFFSET             0x000050  /* Status register for inter-core FIFOs (mailboxes). There is one FIFO in the core 0 -> core 1 direction, and one core 1 -> core 0. Both are 32 bits wide and 8 words deep. Core 0 can see the read side of the 1->0 FIFO (RX), and the write side of 0->1 FIFO (TX). Core 1 can see the read side of the 0->1 FIFO (RX), and the write side of 1->0 FIFO (TX). The SIO IRQ for each core is the logical OR of the VLD, WOF and ROE fields of its FIFO_ST register. */
#define RP2040_SIO_FIFO_WR_OFFSET             0x000054  /* Write access to this core's TX FIFO */
#define RP2040_SIO_FIFO_RD_OFFSET             0x000058  /* Read access to this core's RX FIFO */
#define RP2040_SIO_SPINLOCK_ST_OFFSET         0x00005c  /* Spinlock state A bitmap containing the state of all 32 spinlocks (1=locked). Mainly intended for debugging. */
#define RP2040_SIO_DIV_UDIVIDEND_OFFSET       0x000060  /* Divider unsigned dividend Write to the DIVIDEND operand of the divider, i.e. the p in `p / q`. Any operand write starts a new calculation. The results appear in QUOTIENT, REMAINDER. UDIVIDEND/SDIVIDEND are aliases of the same internal register. The U alias starts an unsigned calculation, and the S alias starts a signed calculation. */
#define RP2040_SIO_DIV_UDIVISOR_OFFSET        0x000064  /* Divider unsigned divisor Write to the DIVISOR operand of the divider, i.e. the q in `p / q`. Any operand write starts a new calculation. The results appear in QUOTIENT, REMAINDER. UDIVIDEND/SDIVIDEND are aliases of the same internal register. The U alias starts an unsigned calculation, and the S alias starts a signed calculation. */
#define RP2040_SIO_DIV_SDIVIDEND_OFFSET       0x000068  /* Divider signed dividend The same as UDIVIDEND, but starts a signed calculation, rather than unsigned. */
#define RP2040_SIO_DIV_SDIVISOR_OFFSET        0x00006c  /* Divider signed divisor The same as UDIVISOR, but starts a signed calculation, rather than unsigned. */
#define RP2040_SIO_DIV_QUOTIENT_OFFSET        0x000070  /* Divider result quotient The result of `DIVIDEND / DIVISOR` (division). Contents undefined while CSR_READY is low. For signed calculations, QUOTIENT is negative when the signs of DIVIDEND and DIVISOR differ. This register can be written to directly, for context save/restore purposes. This halts any in-progress calculation and sets the CSR_READY and CSR_DIRTY flags. Reading from QUOTIENT clears the CSR_DIRTY flag, so should read results in the order REMAINDER, QUOTIENT if CSR_DIRTY is used. */
#define RP2040_SIO_DIV_REMAINDER_OFFSET       0x000074  /* Divider result remainder The result of `DIVIDEND % DIVISOR` (modulo). Contents undefined while CSR_READY is low. For signed calculations, REMAINDER is negative only when DIVIDEND is negative. This register can be written to directly, for context save/restore purposes. This halts any in-progress calculation and sets the CSR_READY and CSR_DIRTY flags. */
#define RP2040_SIO_DIV_CSR_OFFSET             0x000078  /* Control and status register for divider. */
#define RP2040_SIO_INTERP0_ACCUM0_OFFSET      0x000080  /* Read/write access to accumulator 0 */
#define RP2040_SIO_INTERP0_ACCUM1_OFFSET      0x000084  /* Read/write access to accumulator 1 */
#define RP2040_SIO_INTERP0_BASE0_OFFSET       0x000088  /* Read/write access to BASE0 register. */
#define RP2040_SIO_INTERP0_BASE1_OFFSET       0x00008c  /* Read/write access to BASE1 register. */
#define RP2040_SIO_INTERP0_BASE2_OFFSET       0x000090  /* Read/write access to BASE2 register. */
#define RP2040_SIO_INTERP0_POP_LANE0_OFFSET   0x000094  /* Read LANE0 result, and simultaneously write lane results to both accumulators (POP). */
#define RP2040_SIO_INTERP0_POP_LANE1_OFFSET   0x000098  /* Read LANE1 result, and simultaneously write lane results to both accumulators (POP). */
#define RP2040_SIO_INTERP0_POP_FULL_OFFSET    0x00009c  /* Read FULL result, and simultaneously write lane results to both accumulators (POP). */
#define RP2040_SIO_INTERP0_PEEK_LANE0_OFFSET  0x0000a0  /* Read LANE0 result, without altering any internal state (PEEK). */
#define RP2040_SIO_INTERP0_PEEK_LANE1_OFFSET  0x0000a4  /* Read LANE1 result, without altering any internal state (PEEK). */
#define RP2040_SIO_INTERP0_PEEK_FULL_OFFSET   0x0000a8  /* Read FULL result, without altering any internal state (PEEK). */
#define RP2040_SIO_INTERP0_CTRL_LANE0_OFFSET  0x0000ac  /* Control register for lane 0 */
#define RP2040_SIO_INTERP0_CTRL_LANE1_OFFSET  0x0000b0  /* Control register for lane 1 */
#define RP2040_SIO_INTERP0_ACCUM0_ADD_OFFSET  0x0000b4  /* Values written here are atomically added to ACCUM0 Reading yields lane 0's raw shift and mask value (BASE0 not added). */
#define RP2040_SIO_INTERP0_ACCUM1_ADD_OFFSET  0x0000b8  /* Values written here are atomically added to ACCUM1 Reading yields lane 1's raw shift and mask value (BASE1 not added). */
#define RP2040_SIO_INTERP0_BASE_1AND0_OFFSET  0x0000bc  /* On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously. Each half is sign-extended to 32 bits if that lane's SIGNED flag is set. */
#define RP2040_SIO_INTERP1_ACCUM0_OFFSET      0x0000c0  /* Read/write access to accumulator 0 */
#define RP2040_SIO_INTERP1_ACCUM1_OFFSET      0x0000c4  /* Read/write access to accumulator 1 */
#define RP2040_SIO_INTERP1_BASE0_OFFSET       0x0000c8  /* Read/write access to BASE0 register. */
#define RP2040_SIO_INTERP1_BASE1_OFFSET       0x0000cc  /* Read/write access to BASE1 register. */
#define RP2040_SIO_INTERP1_BASE2_OFFSET       0x0000d0  /* Read/write access to BASE2 register. */
#define RP2040_SIO_INTERP1_POP_LANE0_OFFSET   0x0000d4  /* Read LANE0 result, and simultaneously write lane results to both accumulators (POP). */
#define RP2040_SIO_INTERP1_POP_LANE1_OFFSET   0x0000d8  /* Read LANE1 result, and simultaneously write lane results to both accumulators (POP). */
#define RP2040_SIO_INTERP1_POP_FULL_OFFSET    0x0000dc  /* Read FULL result, and simultaneously write lane results to both accumulators (POP). */
#define RP2040_SIO_INTERP1_PEEK_LANE0_OFFSET  0x0000e0  /* Read LANE0 result, without altering any internal state (PEEK). */
#define RP2040_SIO_INTERP1_PEEK_LANE1_OFFSET  0x0000e4  /* Read LANE1 result, without altering any internal state (PEEK). */
#define RP2040_SIO_INTERP1_PEEK_FULL_OFFSET   0x0000e8  /* Read FULL result, without altering any internal state (PEEK). */
#define RP2040_SIO_INTERP1_CTRL_LANE0_OFFSET  0x0000ec  /* Control register for lane 0 */
#define RP2040_SIO_INTERP1_CTRL_LANE1_OFFSET  0x0000f0  /* Control register for lane 1 */
#define RP2040_SIO_INTERP1_ACCUM0_ADD_OFFSET  0x0000f4  /* Values written here are atomically added to ACCUM0 Reading yields lane 0's raw shift and mask value (BASE0 not added). */
#define RP2040_SIO_INTERP1_ACCUM1_ADD_OFFSET  0x0000f8  /* Values written here are atomically added to ACCUM1 Reading yields lane 1's raw shift and mask value (BASE1 not added). */
#define RP2040_SIO_INTERP1_BASE_1AND0_OFFSET  0x0000fc  /* On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously. Each half is sign-extended to 32 bits if that lane's SIGNED flag is set. */
#define RP2040_SIO_SPINLOCK0_OFFSET           0x000100  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK1_OFFSET           0x000104  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK2_OFFSET           0x000108  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK3_OFFSET           0x00010c  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK4_OFFSET           0x000110  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK5_OFFSET           0x000114  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK6_OFFSET           0x000118  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK7_OFFSET           0x00011c  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK8_OFFSET           0x000120  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK9_OFFSET           0x000124  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK10_OFFSET          0x000128  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK11_OFFSET          0x00012c  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK12_OFFSET          0x000130  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK13_OFFSET          0x000134  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK14_OFFSET          0x000138  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK15_OFFSET          0x00013c  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK16_OFFSET          0x000140  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK17_OFFSET          0x000144  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK18_OFFSET          0x000148  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK19_OFFSET          0x00014c  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK20_OFFSET          0x000150  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK21_OFFSET          0x000154  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK22_OFFSET          0x000158  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK23_OFFSET          0x00015c  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK24_OFFSET          0x000160  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK25_OFFSET          0x000164  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK26_OFFSET          0x000168  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK27_OFFSET          0x00016c  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK28_OFFSET          0x000170  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK29_OFFSET          0x000174  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK30_OFFSET          0x000178  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */
#define RP2040_SIO_SPINLOCK31_OFFSET          0x00017c  /* Reading from a spinlock address will: - Return 0 if lock is already locked - Otherwise return nonzero, and simultaneously claim the lock  Writing (any value) releases the lock. If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. The value returned on success is 0x1 << lock number. */

/* Register definitions *****************************************************/

