apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_sio.h
#define RP2040_SIO_CPUID               (RP2040_SIO_BASE + RP2040_SIO_CPUID_OFFSET)
#define RP2040_SIO_GPIO_IN             (RP2040_SIO_BASE + RP2040_SIO_GPIO_IN_OFFSET)
#define RP2040_SIO_GPIO_HI_IN          (RP2040_SIO_BASE + RP2040_SIO_GPIO_HI_IN_OFFSET)
#define RP2040_SIO_GPIO_OUT            (RP2040_SIO_BASE + RP2040_SIO_GPIO_OUT_OFFSET)
#define RP2040_SIO_GPIO_OUT_SET        (RP2040_SIO_BASE + RP2040_SIO_GPIO_OUT_SET_OFFSET)
#define RP2040_SIO_GPIO_OUT_CLR        (RP2040_SIO_BASE + RP2040_SIO_GPIO_OUT_CLR_OFFSET)
#define RP2040_SIO_GPIO_OUT_XOR        (RP2040_SIO_BASE + RP2040_SIO_GPIO_OUT_XOR_OFFSET)
#define RP2040_SIO_GPIO_OE             (RP2040_SIO_BASE + RP2040_SIO_GPIO_OE_OFFSET)
#define RP2040_SIO_GPIO_OE_SET         (RP2040_SIO_BASE + RP2040_SIO_GPIO_OE_SET_OFFSET)
#define RP2040_SIO_GPIO_OE_CLR         (RP2040_SIO_BASE + RP2040_SIO_GPIO_OE_CLR_OFFSET)
#define RP2040_SIO_GPIO_OE_XOR         (RP2040_SIO_BASE + RP2040_SIO_GPIO_OE_XOR_OFFSET)
#define RP2040_SIO_GPIO_HI_OUT         (RP2040_SIO_BASE + RP2040_SIO_GPIO_HI_OUT_OFFSET)
#define RP2040_SIO_GPIO_HI_OUT_SET     (RP2040_SIO_BASE + RP2040_SIO_GPIO_HI_OUT_SET_OFFSET)
#define RP2040_SIO_GPIO_HI_OUT_CLR     (RP2040_SIO_BASE + RP2040_SIO_GPIO_HI_OUT_CLR_OFFSET)
#define RP2040_SIO_GPIO_HI_OUT_XOR     (RP2040_SIO_BASE + RP2040_SIO_GPIO_HI_OUT_XOR_OFFSET)
#define RP2040_SIO_GPIO_HI_OE          (RP2040_SIO_BASE + RP2040_SIO_GPIO_HI_OE_OFFSET)
#define RP2040_SIO_GPIO_HI_OE_SET      (RP2040_SIO_BASE + RP2040_SIO_GPIO_HI_OE_SET_OFFSET)
#define RP2040_SIO_GPIO_HI_OE_CLR      (RP2040_SIO_BASE + RP2040_SIO_GPIO_HI_OE_CLR_OFFSET)
#define RP2040_SIO_GPIO_HI_OE_XOR      (RP2040_SIO_BASE + RP2040_SIO_GPIO_HI_OE_XOR_OFFSET)
#define RP2040_SIO_FIFO_ST             (RP2040_SIO_BASE + RP2040_SIO_FIFO_ST_OFFSET)
#define RP2040_SIO_FIFO_WR             (RP2040_SIO_BASE + RP2040_SIO_FIFO_WR_OFFSET)
#define RP2040_SIO_FIFO_RD             (RP2040_SIO_BASE + RP2040_SIO_FIFO_RD_OFFSET)
#define RP2040_SIO_SPINLOCK_ST         (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK_ST_OFFSET)
#define RP2040_SIO_DIV_UDIVIDEND       (RP2040_SIO_BASE + RP2040_SIO_DIV_UDIVIDEND_OFFSET)
#define RP2040_SIO_DIV_UDIVISOR        (RP2040_SIO_BASE + RP2040_SIO_DIV_UDIVISOR_OFFSET)
#define RP2040_SIO_DIV_SDIVIDEND       (RP2040_SIO_BASE + RP2040_SIO_DIV_SDIVIDEND_OFFSET)
#define RP2040_SIO_DIV_SDIVISOR        (RP2040_SIO_BASE + RP2040_SIO_DIV_SDIVISOR_OFFSET)
#define RP2040_SIO_DIV_QUOTIENT        (RP2040_SIO_BASE + RP2040_SIO_DIV_QUOTIENT_OFFSET)
#define RP2040_SIO_DIV_REMAINDER       (RP2040_SIO_BASE + RP2040_SIO_DIV_REMAINDER_OFFSET)
#define RP2040_SIO_DIV_CSR             (RP2040_SIO_BASE + RP2040_SIO_DIV_CSR_OFFSET)
#define RP2040_SIO_INTERP0_ACCUM0      (RP2040_SIO_BASE + RP2040_SIO_INTERP0_ACCUM0_OFFSET)
#define RP2040_SIO_INTERP0_ACCUM1      (RP2040_SIO_BASE + RP2040_SIO_INTERP0_ACCUM1_OFFSET)
#define RP2040_SIO_INTERP0_BASE0       (RP2040_SIO_BASE + RP2040_SIO_INTERP0_BASE0_OFFSET)
#define RP2040_SIO_INTERP0_BASE1       (RP2040_SIO_BASE + RP2040_SIO_INTERP0_BASE1_OFFSET)
#define RP2040_SIO_INTERP0_BASE2       (RP2040_SIO_BASE + RP2040_SIO_INTERP0_BASE2_OFFSET)
#define RP2040_SIO_INTERP0_POP_LANE0   (RP2040_SIO_BASE + RP2040_SIO_INTERP0_POP_LANE0_OFFSET)
#define RP2040_SIO_INTERP0_POP_LANE1   (RP2040_SIO_BASE + RP2040_SIO_INTERP0_POP_LANE1_OFFSET)
#define RP2040_SIO_INTERP0_POP_FULL    (RP2040_SIO_BASE + RP2040_SIO_INTERP0_POP_FULL_OFFSET)
#define RP2040_SIO_INTERP0_PEEK_LANE0  (RP2040_SIO_BASE + RP2040_SIO_INTERP0_PEEK_LANE0_OFFSET)
#define RP2040_SIO_INTERP0_PEEK_LANE1  (RP2040_SIO_BASE + RP2040_SIO_INTERP0_PEEK_LANE1_OFFSET)
#define RP2040_SIO_INTERP0_PEEK_FULL   (RP2040_SIO_BASE + RP2040_SIO_INTERP0_PEEK_FULL_OFFSET)
#define RP2040_SIO_INTERP0_CTRL_LANE0  (RP2040_SIO_BASE + RP2040_SIO_INTERP0_CTRL_LANE0_OFFSET)
#define RP2040_SIO_INTERP0_CTRL_LANE1  (RP2040_SIO_BASE + RP2040_SIO_INTERP0_CTRL_LANE1_OFFSET)
#define RP2040_SIO_INTERP0_ACCUM0_ADD  (RP2040_SIO_BASE + RP2040_SIO_INTERP0_ACCUM0_ADD_OFFSET)
#define RP2040_SIO_INTERP0_ACCUM1_ADD  (RP2040_SIO_BASE + RP2040_SIO_INTERP0_ACCUM1_ADD_OFFSET)
#define RP2040_SIO_INTERP0_BASE_1AND0  (RP2040_SIO_BASE + RP2040_SIO_INTERP0_BASE_1AND0_OFFSET)
#define RP2040_SIO_INTERP1_ACCUM0      (RP2040_SIO_BASE + RP2040_SIO_INTERP1_ACCUM0_OFFSET)
#define RP2040_SIO_INTERP1_ACCUM1      (RP2040_SIO_BASE + RP2040_SIO_INTERP1_ACCUM1_OFFSET)
#define RP2040_SIO_INTERP1_BASE0       (RP2040_SIO_BASE + RP2040_SIO_INTERP1_BASE0_OFFSET)
#define RP2040_SIO_INTERP1_BASE1       (RP2040_SIO_BASE + RP2040_SIO_INTERP1_BASE1_OFFSET)
#define RP2040_SIO_INTERP1_BASE2       (RP2040_SIO_BASE + RP2040_SIO_INTERP1_BASE2_OFFSET)
#define RP2040_SIO_INTERP1_POP_LANE0   (RP2040_SIO_BASE + RP2040_SIO_INTERP1_POP_LANE0_OFFSET)
#define RP2040_SIO_INTERP1_POP_LANE1   (RP2040_SIO_BASE + RP2040_SIO_INTERP1_POP_LANE1_OFFSET)
#define RP2040_SIO_INTERP1_POP_FULL    (RP2040_SIO_BASE + RP2040_SIO_INTERP1_POP_FULL_OFFSET)
#define RP2040_SIO_INTERP1_PEEK_LANE0  (RP2040_SIO_BASE + RP2040_SIO_INTERP1_PEEK_LANE0_OFFSET)
#define RP2040_SIO_INTERP1_PEEK_LANE1  (RP2040_SIO_BASE + RP2040_SIO_INTERP1_PEEK_LANE1_OFFSET)
#define RP2040_SIO_INTERP1_PEEK_FULL   (RP2040_SIO_BASE + RP2040_SIO_INTERP1_PEEK_FULL_OFFSET)
#define RP2040_SIO_INTERP1_CTRL_LANE0  (RP2040_SIO_BASE + RP2040_SIO_INTERP1_CTRL_LANE0_OFFSET)
#define RP2040_SIO_INTERP1_CTRL_LANE1  (RP2040_SIO_BASE + RP2040_SIO_INTERP1_CTRL_LANE1_OFFSET)
#define RP2040_SIO_INTERP1_ACCUM0_ADD  (RP2040_SIO_BASE + RP2040_SIO_INTERP1_ACCUM0_ADD_OFFSET)
#define RP2040_SIO_INTERP1_ACCUM1_ADD  (RP2040_SIO_BASE + RP2040_SIO_INTERP1_ACCUM1_ADD_OFFSET)
#define RP2040_SIO_INTERP1_BASE_1AND0  (RP2040_SIO_BASE + RP2040_SIO_INTERP1_BASE_1AND0_OFFSET)
#define RP2040_SIO_SPINLOCK0           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK0_OFFSET)
#define RP2040_SIO_SPINLOCK1           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK1_OFFSET)
#define RP2040_SIO_SPINLOCK2           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK2_OFFSET)
#define RP2040_SIO_SPINLOCK3           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK3_OFFSET)
#define RP2040_SIO_SPINLOCK4           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK4_OFFSET)
#define RP2040_SIO_SPINLOCK5           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK5_OFFSET)
#define RP2040_SIO_SPINLOCK6           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK6_OFFSET)
#define RP2040_SIO_SPINLOCK7           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK7_OFFSET)
#define RP2040_SIO_SPINLOCK8           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK8_OFFSET)
#define RP2040_SIO_SPINLOCK9           (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK9_OFFSET)
#define RP2040_SIO_SPINLOCK10          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK10_OFFSET)
#define RP2040_SIO_SPINLOCK11          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK11_OFFSET)
#define RP2040_SIO_SPINLOCK12          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK12_OFFSET)
#define RP2040_SIO_SPINLOCK13          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK13_OFFSET)
#define RP2040_SIO_SPINLOCK14          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK14_OFFSET)
#define RP2040_SIO_SPINLOCK15          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK15_OFFSET)
#define RP2040_SIO_SPINLOCK16          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK16_OFFSET)
#define RP2040_SIO_SPINLOCK17          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK17_OFFSET)
#define RP2040_SIO_SPINLOCK18          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK18_OFFSET)
#define RP2040_SIO_SPINLOCK19          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK19_OFFSET)
#define RP2040_SIO_SPINLOCK20          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK20_OFFSET)
#define RP2040_SIO_SPINLOCK21          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK21_OFFSET)
#define RP2040_SIO_SPINLOCK22          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK22_OFFSET)
#define RP2040_SIO_SPINLOCK23          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK23_OFFSET)
#define RP2040_SIO_SPINLOCK24          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK24_OFFSET)
#define RP2040_SIO_SPINLOCK25          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK25_OFFSET)
#define RP2040_SIO_SPINLOCK26          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK26_OFFSET)
#define RP2040_SIO_SPINLOCK27          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK27_OFFSET)
#define RP2040_SIO_SPINLOCK28          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK28_OFFSET)
#define RP2040_SIO_SPINLOCK29          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK29_OFFSET)
#define RP2040_SIO_SPINLOCK30          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK30_OFFSET)
#define RP2040_SIO_SPINLOCK31          (RP2040_SIO_BASE + RP2040_SIO_SPINLOCK31_OFFSET)

/* Register bit definitions *************************************************/

