apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_sio.h
#define RP2040_SIO_GPIO_IN_MASK                        (0x3fffffff)  /* Input value for GPIO0...29 */

#define RP2040_SIO_GPIO_HI_IN_MASK                     (0x3f)        /* Input value on QSPI IO in order 0..5: SCLK, SSn, SD0, SD1, SD2, SD3 */

#define RP2040_SIO_GPIO_OUT_MASK                       (0x3fffffff)  /* Set output level (1/0 -> high/low) for GPIO0...29. Reading back gives the last value written, NOT the input value from the pins. If core 0 and core 1 both write to GPIO_OUT simultaneously (or to a SET/CLR/XOR alias), the result is as though the write from core 0 took place first, and the write from core 1 was then applied to that intermediate result. */

#define RP2040_SIO_GPIO_OUT_SET_MASK                   (0x3fffffff)  /* Perform an atomic bit-set on GPIO_OUT, i.e. `GPIO_OUT |= wdata` */

#define RP2040_SIO_GPIO_OUT_CLR_MASK                   (0x3fffffff)  /* Perform an atomic bit-clear on GPIO_OUT, i.e. `GPIO_OUT &= ~wdata` */

#define RP2040_SIO_GPIO_OUT_XOR_MASK                   (0x3fffffff)  /* Perform an atomic bitwise XOR on GPIO_OUT, i.e. `GPIO_OUT ^= wdata` */

#define RP2040_SIO_GPIO_OE_MASK                        (0x3fffffff)  /* Set output enable (1/0 -> output/input) for GPIO0...29. Reading back gives the last value written. If core 0 and core 1 both write to GPIO_OE simultaneously (or to a SET/CLR/XOR alias), the result is as though the write from core 0 took place first, and the write from core 1 was then applied to that intermediate result. */

#define RP2040_SIO_GPIO_OE_SET_MASK                    (0x3fffffff)  /* Perform an atomic bit-set on GPIO_OE, i.e. `GPIO_OE |= wdata` */

#define RP2040_SIO_GPIO_OE_CLR_MASK                    (0x3fffffff)  /* Perform an atomic bit-clear on GPIO_OE, i.e. `GPIO_OE &= ~wdata` */

#define RP2040_SIO_GPIO_OE_XOR_MASK                    (0x3fffffff)  /* Perform an atomic bitwise XOR on GPIO_OE, i.e. `GPIO_OE ^= wdata` */

#define RP2040_SIO_GPIO_HI_OUT_MASK                    (0x3f)  /* Set output level (1/0 -> high/low) for QSPI IO0...5. Reading back gives the last value written, NOT the input value from the pins. If core 0 and core 1 both write to GPIO_HI_OUT simultaneously (or to a SET/CLR/XOR alias), the result is as though the write from core 0 took place first, and the write from core 1 was then applied to that intermediate result. */

#define RP2040_SIO_GPIO_HI_OUT_SET_MASK                (0x3f)  /* Perform an atomic bit-set on GPIO_HI_OUT, i.e. `GPIO_HI_OUT |= wdata` */

#define RP2040_SIO_GPIO_HI_OUT_CLR_MASK                (0x3f)  /* Perform an atomic bit-clear on GPIO_HI_OUT, i.e. `GPIO_HI_OUT &= ~wdata` */

#define RP2040_SIO_GPIO_HI_OUT_XOR_MASK                (0x3f)  /* Perform an atomic bitwise XOR on GPIO_HI_OUT, i.e. `GPIO_HI_OUT ^= wdata` */

#define RP2040_SIO_GPIO_HI_OE_MASK                     (0x3f)  /* Set output enable (1/0 -> output/input) for QSPI IO0...5. Reading back gives the last value written. If core 0 and core 1 both write to GPIO_HI_OE simultaneously (or to a SET/CLR/XOR alias), the result is as though the write from core 0 took place first, and the write from core 1 was then applied to that intermediate result. */

#define RP2040_SIO_GPIO_HI_OE_SET_MASK                 (0x3f)  /* Perform an atomic bit-set on GPIO_HI_OE, i.e. `GPIO_HI_OE |= wdata` */

#define RP2040_SIO_GPIO_HI_OE_CLR_MASK                 (0x3f)  /* Perform an atomic bit-clear on GPIO_HI_OE, i.e. `GPIO_HI_OE &= ~wdata` */

#define RP2040_SIO_GPIO_HI_OE_XOR_MASK                 (0x3f)  /* Perform an atomic bitwise XOR on GPIO_HI_OE, i.e. `GPIO_HI_OE ^= wdata` */

#define RP2040_SIO_FIFO_ST_ROE                         (1 << 3)  /* Sticky flag indicating the RX FIFO was read when empty. This read was ignored by the FIFO. */
#define RP2040_SIO_FIFO_ST_WOF                         (1 << 2)  /* Sticky flag indicating the TX FIFO was written when full. This write was ignored by the FIFO. */
#define RP2040_SIO_FIFO_ST_RDY                         (1 << 1)  /* Value is 1 if this core's TX FIFO is not full (i.e. if FIFO_WR is ready for more data) */
#define RP2040_SIO_FIFO_ST_VLD                         (1 << 0)  /* Value is 1 if this core's RX FIFO is not empty (i.e. if FIFO_RD is valid) */

#define RP2040_SIO_DIV_CSR_DIRTY                       (1 << 1)  /* Changes to 1 when any register is written, and back to 0 when QUOTIENT is read. Software can use this flag to make save/restore more efficient (skip if not DIRTY). If the flag is used in this way, it's recommended to either read QUOTIENT only, or REMAINDER and then QUOTIENT, to prevent data loss on context switch. */
#define RP2040_SIO_DIV_CSR_READY                       (1 << 0)  /* Reads as 0 when a calculation is in progress, 1 otherwise. Writing an operand (xDIVIDEND, xDIVISOR) will immediately start a new calculation, no matter if one is already in progress. Writing to a result register will immediately terminate any in-progress calculation and set the READY and DIRTY flags. */

#define RP2040_SIO_INTERP0_CTRL_LANE0_OVERF            (1 << 25)  /* Set if either OVERF0 or OVERF1 is set. */
#define RP2040_SIO_INTERP0_CTRL_LANE0_OVERF1           (1 << 24)  /* Indicates if any masked-off MSBs in ACCUM1 are set. */
#define RP2040_SIO_INTERP0_CTRL_LANE0_OVERF0           (1 << 23)  /* Indicates if any masked-off MSBs in ACCUM0 are set. */
#define RP2040_SIO_INTERP0_CTRL_LANE0_BLEND            (1 << 21)  /* Only present on INTERP0 on each core. If BLEND mode is enabled: - LANE1 result is a linear interpolation between BASE0 and BASE1, controlled by the 8 LSBs of lane 1 shift and mask value (a fractional number between 0 and 255/256ths) - LANE0 result does not have BASE0 added (yields only the 8 LSBs of lane 1 shift+mask value) - FULL result does not have lane 1 shift+mask value added (BASE2 + lane 0 shift+mask) LANE1 SIGNED flag controls whether the interpolation is signed or unsigned. */
#define RP2040_SIO_INTERP0_CTRL_LANE0_FORCE_MSB_SHIFT  (19)       /* ORed into bits 29:28 of the lane result presented to the processor on the bus. No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence of pointers into flash or SRAM. */
#define RP2040_SIO_INTERP0_CTRL_LANE0_FORCE_MSB_MASK   (0x03 << RP2040_SIO_INTERP0_CTRL_LANE0_FORCE_MSB_SHIFT)
#define RP2040_SIO_INTERP0_CTRL_LANE0_ADD_RAW          (1 << 18)  /* If 1, mask + shift is bypassed for LANE0 result. This does not affect FULL result. */
#define RP2040_SIO_INTERP0_CTRL_LANE0_CROSS_RESULT     (1 << 17)  /* If 1, feed the opposite lane's result into this lane's accumulator on POP. */
#define RP2040_SIO_INTERP0_CTRL_LANE0_CROSS_INPUT      (1 << 16)  /* If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware. Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass) */
#define RP2040_SIO_INTERP0_CTRL_LANE0_SIGNED           (1 << 15)  /* If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits before adding to BASE0, and LANE0 PEEK/POP appear extended to 32 bits when read by processor. */
#define RP2040_SIO_INTERP0_CTRL_LANE0_MASK_MSB_SHIFT   (10)       /* The most-significant bit allowed to pass by the mask (inclusive) Setting MSB < LSB may cause chip to turn inside-out */
#define RP2040_SIO_INTERP0_CTRL_LANE0_MASK_MSB_MASK    (0x1f << RP2040_SIO_INTERP0_CTRL_LANE0_MASK_MSB_SHIFT)
#define RP2040_SIO_INTERP0_CTRL_LANE0_MASK_LSB_SHIFT   (5)        /* The least-significant bit allowed to pass by the mask (inclusive) */
#define RP2040_SIO_INTERP0_CTRL_LANE0_MASK_LSB_MASK    (0x1f << RP2040_SIO_INTERP0_CTRL_LANE0_MASK_LSB_SHIFT)
#define RP2040_SIO_INTERP0_CTRL_LANE0_SHIFT_MASK       (0x1f)     /* Logical right-shift applied to accumulator before masking */

